/* Задача 8: Напишите программу, которая на вход принимает число (N), 
а на выходе показывает все чётные числа от 1 до N.

5 -> 2, 4
8 -> 2, 4, 6, 8

можно (нужно) делать без явного ввода данных с консоли */


/* int N = 5;
int a = 2;
int result = (a % 2);

while (a < (N + 1))
{

Console.Write(a);
    a = a + 2;
} */

int N = 8;
int a = 2;
int result = (a % 2);

while (a < (N + 1))
{

    Console.Write(a);
    a = a + 2;
}


